{
  "version": 1,
  "items": [
    {
      "id": "SHELL-001",
      "title": "Scaffold canonical loop center/radius/tangent",
      "acceptance": [
        "loop/ exists with GOAL.md, RULES.md, log.txt, last_error.txt",
        "scripts/ralph/loop.sh and radius.sh exist",
        "CI runs and blocks invalid loop state",
        "progress.txt exists and receives a first entry"
      ],
      "passes": true,
      "notes": "Implemented loop center files, radius enforcement scripts, CI back-pressure, and pre-commit config."
    },
    {
      "id": "DECIDE-001",
      "title": "Document a closed-loop decision spec and verification gates",
      "acceptance": [
        "loop/LOOPSPEC.md defines the minimal loop contract fields",
        "LoopSpec includes explicit verification gates and stop rules",
        "Acceptance test describes required artifacts and verifier output"
      ],
      "passes": true,
      "notes": "Documented LoopSpec with gates, budgets, and stop rules in loop/LOOPSPEC.md."
    },
    {
      "id": "REPORT-001",
      "title": "Provide an LLM planning report for GitHub work",
      "acceptance": [
        "loop/PLAN_REPORT.md summarizes repo goals, constraints, and loop contract",
        "Report includes actionable planning steps and required artifacts",
        "Report highlights risks and verification gates"
      ],
      "passes": true,
      "notes": "Added loop/PLAN_REPORT.md to guide LLM planning with gates, risks, and artifacts."
    },
    {
      "id": "REPORT-002",
      "title": "Provide a GitHub planning report for the Ralph loop master prompt",
      "acceptance": [
        "loop/GITHUB_PLAN_REPORT.md summarizes required files and constraints",
        "Report includes a step-by-step plan aligned to one-task-per-iteration",
        "Report lists verification gates and risks"
      ],
      "passes": true,
      "notes": "Added loop/GITHUB_PLAN_REPORT.md with constraints, plan, gates, and risks."
    },
    {
      "id": "TRACK-001",
      "title": "Add task tracking checklist for Ralph loop deliverables",
      "acceptance": [
        "loop/TASK_TRACKING.md lists phases and tasks with checkboxes",
        "Checklist matches the requested Phase 1-6 items"
      ],
      "passes": true,
      "notes": "Added loop/TASK_TRACKING.md with phase checklists and tasks."
    },
    {
      "id": "TRACK-002",
      "title": "Clarify loop repetition guidance in task tracking",
      "acceptance": [
        "loop/TASK_TRACKING.md includes guidance to repeat until all tasks complete",
        "Guidance references updating checkboxes per iteration"
      ],
      "passes": true,
      "notes": "Added repetition guidance to task tracking checklist."
    },
    {
      "id": "REPORT-003",
      "title": "Update GitHub plan for autocommit zero-friction workflow",
      "acceptance": [
        "loop/GITHUB_PLAN_REPORT.md references GitHub autocommit zero-friction flow",
        "Plan steps mention auto-commit behavior and safeguards"
      ],
      "passes": true,
      "notes": "Updated GitHub plan with autocommit zero-friction guidance and safeguards."
    },
    {
      "id": "STATUS-001",
      "title": "Add checkpoint ledger for one-milestone loop cycles",
      "acceptance": [
        "IMPLEMENTATION_STATUS.md exists with cycle checkpoint schema",
        "At least one completed cycle entry includes commands and exit codes",
        "README references checkpoint updates as part of the operating loop"
      ],
      "passes": true,
      "notes": "Added IMPLEMENTATION_STATUS.md with checkpoint schema and completed cycle entry; documented status ledger usage in README."
    }
  ]
}
